### Pandas melt() Function

### What is melt() in Pandas?

The melt() function is used to reshape a DataFrame from wide format to long format.

#### In simple words:

It converts multiple columns into rows

### Why is melt() used?

• You use melt() when:

• Data is in wide format

• You want tidy / long data

• Preparing data for visualization (Seaborn, Matplotlib)

• Preparing data for machine learning

• Similar to UNPIVOT in SQL

### Syntax

pd.melt(
    frame,
    id_vars=None,
    value_vars=None,
    var_name=None,
    value_name='value',
    col_level=None,
    ignore_index=True
)

### Parameters Explained

### 1.frame (Required)

The DataFrame to reshape.

pd.melt(frame=df)

In [13]:
# Example
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Math': [90, 80],
    'Science': [85, 95]
})

print("Original DataFrame:\n", df, "\n")

melted = pd.melt(frame=df)
print("Melted DataFrame:\n", melted)

Original DataFrame:
    Name  Math  Science
0   Ali    90       85
1  Sara    80       95

Melted DataFrame:
   variable value
0     Name   Ali
1     Name  Sara
2     Math    90
3     Math    80
4  Science    85
5  Science    95

In [14]:
# Example with parameters:
pd.melt(frame=df, id_vars=['Name'], value_vars=['Math','Science'], var_name='Subject', value_name='Score')

   Name  Subject  Score
0   Ali     Math     90
1  Sara     Math     80
2   Ali  Science     85
3  Sara  Science     95

### 2.id_vars

Column(s) to keep fixed (identifier columns).

id_vars=['Name']


Multiple:

id_vars=['Name', 'Class']

In [15]:
# Case 1: Single identifier column
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Math': [90, 80],
    'Science': [85, 95]
})

melted = pd.melt(frame=df, id_vars=['Name'])
print(melted)
# Here, Name stays fixed, while Math and Science are melted into rows.

   Name variable  value
0   Ali     Math     90
1  Sara     Math     80
2   Ali  Science     85
3  Sara  Science     95

In [16]:
# Case 2: Multiple identifier columns
df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Class': ['10th', '12th'],
    'Math': [90, 80],
    'Science': [85, 95]
})

melted = pd.melt(frame=df, id_vars=['Name','Class'])
print(melted)
#  Now both Name and Class stay fixed, while Math and Science are melted.

   Name Class variable  value
0   Ali  10th     Math     90
1  Sara  12th     Math     80
2   Ali  10th  Science     85
3  Sara  12th  Science     95

### 3.### 3.value_vars

Column(s) to unpivot.

value_vars=['Math', 'Science']

If not provided → all columns except id_vars are melted.

In [17]:
# Example
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Math': [90, 80],
    'Science': [85, 95],
    'English': [88, 92]
})

print("Original DataFrame:\n", df, "\n")

melted = pd.melt(frame=df, id_vars=['Name'], value_vars=['Math','Science'])
print("Melted DataFrame:\n", melted)

Original DataFrame:
    Name  Math  Science  English
0   Ali    90       85       88
1  Sara    80       95       92

Melted DataFrame:
    Name variable  value
0   Ali     Math     90
1  Sara     Math     80
2   Ali  Science     85
3  Sara  Science     95

### 4.var_name

Name of the new column that will store old column names.

var_name='Subject'

In [18]:
# Example
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Math': [90, 80],
    'Science': [85, 95]
})

melted = pd.melt(
    frame=df,
    id_vars=['Name'],
    value_vars=['Math','Science'],
    var_name='Subject'
)

print(melted)

   Name  Subject  value
0   Ali     Math     90
1  Sara     Math     80
2   Ali  Science     85
3  Sara  Science     95

### 5.value_name (Default: 'value')

Name of the new column that stores values.

value_name='Marks'

In [19]:
# Example
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Math': [90, 80],
    'Science': [85, 95]
})

melted = pd.melt(
    frame=df,
    id_vars=['Name'],
    value_vars=['Math','Science'],
    var_name='Subject',
    value_name='Marks'
)

print(melted)

   Name  Subject  Marks
0   Ali     Math     90
1  Sara     Math     80
2   Ali  Science     85
3  Sara  Science     95

### 6.col_level

Used when DataFrame has MultiIndex columns.

col_level=0

Rarely used (advanced)

In [20]:
# Example
import pandas as pd

# Create a DataFrame with MultiIndex columns
arrays = [
    ['Marks', 'Marks', 'Attendance', 'Attendance'],
    ['Math', 'Science', 'Math', 'Science']
]
multi_index = pd.MultiIndex.from_arrays(arrays, names=('Category','Subject'))

df = pd.DataFrame(
    [[90, 85, 'Yes', 'No'],
     [80, 95, 'Yes', 'Yes']],
    columns=multi_index
)

print("Original DataFrame:\n", df, "\n")

# Melt using col_level=0 (outer level)
melted_outer = pd.melt(df, col_level=0)
print("Melted with col_level=0:\n", melted_outer, "\n")

# Melt using col_level=1 (inner level)
melted_inner = pd.melt(df, col_level=1)
print("Melted with col_level=1:\n", melted_inner)

Original DataFrame:
 Category Marks         Attendance
Subject   Math Science       Math Science
0           90      85        Yes      No
1           80      95        Yes     Yes

Melted with col_level=0:
      Category value
0       Marks    90
1       Marks    80
2       Marks    85
3       Marks    95
4  Attendance   Yes
5  Attendance   Yes
6  Attendance    No
7  Attendance   Yes

Melted with col_level=1:
    Subject value
0     Math    90
1     Math    80
2  Science    85
3  Science    95
4     Math   Yes
5     Math   Yes
6  Science    No
7  Science   Yes

### 7.ignore_index (Default: True)

True → new index (0,1,2…)

• False → keeps original index

• ignore_index=False

In [21]:
# Example
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Math': [90, 80],
    'Science': [85, 95]
}, index=['row1','row2'])

print("Original DataFrame:\n", df, "\n")

# Melt with ignore_index=True (default)
melted_true = pd.melt(df, id_vars=['Name'], value_vars=['Math','Science'], ignore_index=True)
print("Melted with ignore_index=True:\n", melted_true, "\n")

# Melt with ignore_index=False
melted_false = pd.melt(df, id_vars=['Name'], value_vars=['Math','Science'], ignore_index=False)
print("Melted with ignore_index=False:\n", melted_false)

Original DataFrame:
       Name  Math  Science
row1   Ali    90       85
row2  Sara    80       95

Melted with ignore_index=True:
    Name variable  value
0   Ali     Math     90
1  Sara     Math     80
2   Ali  Science     85
3  Sara  Science     95

Melted with ignore_index=False:
       Name variable  value
row1   Ali     Math     90
row2  Sara     Math     80
row1   Ali  Science     85
row2  Sara  Science     95

### Simple Example
Original Data (Wide Format)

In [22]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Math': [85, 90],
    'Science': [88, 92],
    'English': [80, 89]
})
df

   Name  Math  Science  English
0   Ali    85       88       80
1  Sara    90       92       89

In [23]:
# Apply melt()
melted = pd.melt(
    df,
    id_vars='Name',
    var_name='Subject',
    value_name='Marks'
)
print(melted)

   Name  Subject  Marks
0   Ali     Math     85
1  Sara     Math     90
2   Ali  Science     88
3  Sara  Science     92
4   Ali  English     80
5  Sara  English     89

In [24]:
# Melt Specific Columns
pd.melt(df,
        id_vars='Name',
        value_vars=['Math', 'Science'])

   Name variable  value
0   Ali     Math     85
1  Sara     Math     90
2   Ali  Science     88
3  Sara  Science     92

### DataFrame Reshaping: melt() vs pivot()

| Feature | `melt()` | `pivot()` |
|---------|----------|-----------|
| **Direction** | Wide → Long | Long → Wide |
| **SQL Equivalent** | UNPIVOT | PIVOT |
| **Aggregation** | No | No |
| **Duplicate Handling** | Handles duplicates | Fails with duplicates |
| **Best For** | Unpivoting data | Creating pivot views |
| **Common Use** | Preparing data for analysis | Creating summary tables |